//https://www.luogu.com.cn/problem/P3205#ide
#include <iostream>
using namespace std;
// f[i][j][0]表示区间[i,j]中的元素已排好，且最后一个被加入的人是左端点i的方案数
// f[i][j][1]表示区间[i,j]中的元素已排好，且最后一个被加入的人是右端点j的方案数
int dp[2010][2010][2],a[2010];

int main() {
    int n;
    cin >> n;
    for (int i = 1; i <= n; i++)
        cin >> a[i];
    for (int i = 1; i <= n; i++)
        dp[i][i][0]=1;//初始化：区间长度为1时只有一种队形

    for (int len=1;len<=n;len++)//枚举区间长度
        for (int i=1,j=i+len;j<=n;i++,j++) {//枚举左端点,右端点
            //1.处理最后加入的是左端点i的情况(f[i][j][0])
            //上一步区间为[i+1,j]
            //分别讨论前一步是加在左端还是右端
            //上一步最后加入的是i+1(左端点)
            if (a[i]<a[i+1])//新加入的i比上一个人i+1(左边入队)矮,放在队列左侧
                dp[i][j][0]+=dp[i+1][j][0];
            //上一步最后加入的是j(右端点)
            if (a[i]<a[j])//新加入的i比上一个人j(右边入队)矮,可放在左侧
                dp[i][j][0]+=dp[i+1][j][1];

            //2.处理最后加入的是右端点j的情况(f[i][j][1])
            //上一步区间为[i,j-1]
            //上一步最后加入的是i(左端点)
            if (a[j]>a[i])//新加入的j比上一个人i(左边加入)高,可放在右侧
                dp[i][j][1]+=dp[i][j-1][0];
            //上一步最后加入的是j-1(右端点）
            if (a[j]>a[j-1])//新加入的j比上一个人j-1(右边加入)高,可放在右侧
                dp[i][j][1] += dp[i][j-1][1];
            //取模
            dp[i][j][0]%=19650827;
            dp[i][j][1]%=19650827;
        }

    // 最终答案为整个区间[1,n]的两种可能状态之和
    cout<<(dp[1][n][0]+dp[1][n][1])%19650827<<endl;
    return 0;
}